Revit 2027 API
DefinitionGroups.Contains Method
Tests for the existence of a definition group within the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	DefinitionGroup definitionGroup
)
Public Function Contains (
	definitionGroup As DefinitionGroup
) As Boolean
public:
bool Contains(
	DefinitionGroup^ definitionGroup
)
member Contains :
        definitionGroup : DefinitionGroup -> bool
Parameters
definitionGroup DefinitionGroup
The definition group to look for.
Return Value
Boolean
True if the definition group was found, false otherwise.
See Also
Reference
DefinitionGroups Class
Autodesk.Revit.DB Namespace